OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1567.h
extern __at(0x0692) __sfr AAD1TX0;

typedef struct
  {
  unsigned TX10                 : 1;
  unsigned TX11                 : 1;
  unsigned TX12                 : 1;
  unsigned TX13                 : 1;
  unsigned TX14                 : 1;
  unsigned TX15                 : 1;
  unsigned TX16                 : 1;
  unsigned TX17                 : 1;
  } __AAD1TX0bits_t;

extern __at(0x0692) volatile __AAD1TX0bits_t AAD1TX0bits;

#define _TX10                   0x01
#define _TX11                   0x02
#define _TX12                   0x04
#define _TX13                   0x08
#define _TX14                   0x10
#define _TX15                   0x20
#define _TX16                   0x40
#define _TX17                   0x80

//==============================================================================

extern __at(0x0692) __sfr AD1TX;

//==============================================================================
//        AD1TX0 Bits

extern __at(0x0692) __sfr AD1TX0;

typedef struct
  {
  unsigned TX10                 : 1;
  unsigned TX11                 : 1;
  unsigned TX12                 : 1;
  unsigned TX13                 : 1;
  unsigned TX14                 : 1;
  unsigned TX15                 : 1;
  unsigned TX16                 : 1;
  unsigned TX17                 : 1;
  } __AD1TX0bits_t;

extern __at(0x0692) volatile __AD1TX0bits_t AD1TX0bits;

#define _AD1TX0_TX10            0x01
#define _AD1TX0_TX11            0x02
#define _AD1TX0_TX12            0x04
#define _AD1TX0_TX13            0x08
#define _AD1TX0_TX14            0x10
#define _AD1TX0_TX15            0x20
#define _AD1TX0_TX16            0x40
#define _AD1TX0_TX17            0x80

//==============================================================================


//==============================================================================
//        AAD1TX1 Bits

extern __at(0x0693) __sfr AAD1TX1;

typedef struct
  {
  unsigned TX18                 : 1;
  unsigned TX19                 : 1;
  unsigned TX30                 : 1;
  unsigned TX31                 : 1;
  unsigned TX32                 : 1;
  unsigned TX33                 : 1;
  unsigned TX34                 : 1;
  unsigned TX35                 : 1;
  } __AAD1TX1bits_t;

extern __at(0x0693) volatile __AAD1TX1bits_t AAD1TX1bits;

#define _TX18                   0x01
#define _TX19                   0x02
#define _TX30                   0x04
#define _TX31                   0x08
#define _TX32                   0x10
#define _TX33                   0x20
#define _TX34                   0x40
#define _TX35                   0x80

//==============================================================================


//==============================================================================
//        AD1TX1 Bits

extern __at(0x0693) __sfr AD1TX1;

typedef struct
  {
  unsigned TX18                 : 1;
  unsigned TX19                 : 1;
  unsigned TX30                 : 1;
  unsigned TX31                 : 1;
  unsigned TX32                 : 1;
  unsigned TX33                 : 1;
  unsigned TX34                 : 1;
  unsigned TX35                 : 1;
  } __AD1TX1bits_t;

extern __at(0x0693) volatile __AD1TX1bits_t AD1TX1bits;

#define _AD1TX1_TX18            0x01
#define _AD1TX1_TX19            0x02
#define _AD1TX1_TX30            0x04
#define _AD1TX1_TX31            0x08
#define _AD1TX1_TX32            0x10
#define _AD1TX1_TX33            0x20
#define _AD1TX1_TX34            0x40
#define _AD1TX1_TX35            0x80

//==============================================================================

extern __at(0x0694) __sfr AAD2TX;

//==============================================================================
//        AAD2TX0 Bits

extern __at(0x0694) __sfr AAD2TX0;

typedef struct
  {
  unsigned TX20                 : 1;
  unsigned TX21                 : 1;
  unsigned TX22                 : 1;
  unsigned TX23                 : 1;
  unsigned TX24                 : 1;
  unsigned TX25                 : 1;
  unsigned TX26                 : 1;
  unsigned TX27                 : 1;
  } __AAD2TX0bits_t;

extern __at(0x0694) volatile __AAD2TX0bits_t AAD2TX0bits;

#define _TX20                   0x01
#define _TX21                   0x02
#define _TX22                   0x04
#define _TX23                   0x08
#define _TX24                   0x10
#define _TX25                   0x20
#define _TX26                   0x40
#define _TX27                   0x80

//==============================================================================

extern __at(0x0694) __sfr AD2TX;

//==============================================================================
//        AD2TX0 Bits

extern __at(0x0694) __sfr AD2TX0;

typedef struct
  {
  unsigned TX20                 : 1;
  unsigned TX21                 : 1;
  unsigned TX22                 : 1;
  unsigned TX23                 : 1;
  unsigned TX24                 : 1;
  unsigned TX25                 : 1;
  unsigned TX26                 : 1;
  unsigned TX27                 : 1;
  } __AD2TX0bits_t;

extern __at(0x0694) volatile __AD2TX0bits_t AD2TX0bits;

#define _AD2TX0_TX20            0x01
#define _AD2TX0_TX21            0x02
#define _AD2TX0_TX22            0x04
#define _AD2TX0_TX23            0x08
#define _AD2TX0_TX24            0x10
#define _AD2TX0_TX25            0x20
#define _AD2TX0_TX26            0x40
#define _AD2TX0_TX27            0x80

//==============================================================================


//==============================================================================
//        AAD2TX1 Bits

extern __at(0x0695) __sfr AAD2TX1;

typedef struct
  {
  unsigned TX28                 : 1;
  unsigned TX29                 : 1;
  unsigned TX40                 : 1;
  unsigned TX41                 : 1;
  unsigned TX42                 : 1;
  unsigned TX43                 : 1;
  unsigned TX44                 : 1;
  unsigned TX45                 : 1;
  } __AAD2TX1bits_t;

extern __at(0x0695) volatile __AAD2TX1bits_t AAD2TX1bits;

#define _TX28                   0x01
#define _TX29                   0x02
#define _TX40                   0x04
#define _TX41                   0x08
#define _TX42                   0x10
#define _TX43                   0x20
#define _TX44                   0x40
#define _TX45                   0x80

//==============================================================================


//==============================================================================
//        AD2TX1 Bits

