OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1567.h
extern __at(0x0719) __sfr AAD1CAP;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AAD1CAPbits_t;

extern __at(0x0719) volatile __AAD1CAPbits_t AAD1CAPbits;

#define _ADDCAP0                0x01
#define _ADDCAP1                0x02
#define _ADDCAP2                0x04
#define _ADDCAP3                0x08

//==============================================================================


//==============================================================================
//        AAD1CAPCON Bits

extern __at(0x0719) __sfr AAD1CAPCON;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AAD1CAPCONbits_t;

extern __at(0x0719) volatile __AAD1CAPCONbits_t AAD1CAPCONbits;

#define _AAD1CAPCON_ADDCAP0     0x01
#define _AAD1CAPCON_ADDCAP1     0x02
#define _AAD1CAPCON_ADDCAP2     0x04
#define _AAD1CAPCON_ADDCAP3     0x08

//==============================================================================


//==============================================================================
//        AADCAP Bits

extern __at(0x0719) __sfr AADCAP;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AADCAPbits_t;

extern __at(0x0719) volatile __AADCAPbits_t AADCAPbits;

#define _AADCAP_ADDCAP0         0x01
#define _AADCAP_ADDCAP1         0x02
#define _AADCAP_ADDCAP2         0x04
#define _AADCAP_ADDCAP3         0x08

//==============================================================================


//==============================================================================
//        AD1CAPCON Bits

extern __at(0x0719) __sfr AD1CAPCON;

typedef union
  {
  struct
    {
    unsigned ADDCAP0            : 1;
    unsigned ADDCAP1            : 1;
    unsigned ADDCAP2            : 1;
    unsigned ADDCAP3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADDCAP             : 4;
    unsigned                    : 4;
    };
  } __AD1CAPCONbits_t;

extern __at(0x0719) volatile __AD1CAPCONbits_t AD1CAPCONbits;

#define _AD1CAPCON_ADDCAP0      0x01
#define _AD1CAPCON_ADDCAP1      0x02
#define _AD1CAPCON_ADDCAP2      0x04
#define _AD1CAPCON_ADDCAP3      0x08

//==============================================================================

extern __at(0x071A) __sfr AAD1RES0;
extern __at(0x071A) __sfr AAD1RES0L;
extern __at(0x071A) __sfr AD1RES0;
extern __at(0x071A) __sfr AD1RES0L;
extern __at(0x071A) __sfr ADRES0;
extern __at(0x071B) __sfr AAD1RES0H;
extern __at(0x071B) __sfr AD1RES0H;
extern __at(0x071C) __sfr AAD1RES1;
extern __at(0x071C) __sfr AAD1RES1L;
extern __at(0x071C) __sfr AD1RES1;
extern __at(0x071C) __sfr AD1RES1L;
extern __at(0x071C) __sfr ADRES1;
extern __at(0x071D) __sfr AAD1RES1H;
extern __at(0x071D) __sfr AD1RES1H;
extern __at(0x071E) __sfr AAD1CH;

//==============================================================================
//        AAD1CH0 Bits

extern __at(0x071E) __sfr AAD1CH0;

typedef struct
  {
  unsigned CH10                 : 1;
  unsigned CH11                 : 1;
  unsigned CH12                 : 1;
  unsigned CH13                 : 1;
  unsigned CH14                 : 1;
  unsigned CH15                 : 1;
  unsigned CH16                 : 1;
  unsigned CHS17                : 1;
  } __AAD1CH0bits_t;

extern __at(0x071E) volatile __AAD1CH0bits_t AAD1CH0bits;

#define _CH10                   0x01
#define _CH11                   0x02
#define _CH12                   0x04
#define _CH13                   0x08
#define _CH14                   0x10
#define _CH15                   0x20
#define _CH16                   0x40
#define _CHS17                  0x80

//==============================================================================

extern __at(0x071E) __sfr AD1CH;

//==============================================================================
//        AD1CH0 Bits

extern __at(0x071E) __sfr AD1CH0;

typedef struct
  {
  unsigned CH10                 : 1;
  unsigned CH11                 : 1;
  unsigned CH12                 : 1;
  unsigned CH13                 : 1;
  unsigned CH14                 : 1;
  unsigned CH15                 : 1;
  unsigned CH16                 : 1;
  unsigned CHS17                : 1;
  } __AD1CH0bits_t;

extern __at(0x071E) volatile __AD1CH0bits_t AD1CH0bits;

#define _AD1CH0_CH10            0x01
#define _AD1CH0_CH11            0x02
#define _AD1CH0_CH12            0x04
#define _AD1CH0_CH13            0x08
#define _AD1CH0_CH14            0x10
#define _AD1CH0_CH15            0x20
#define _AD1CH0_CH16            0x40
#define _AD1CH0_CHS17           0x80

//==============================================================================


//==============================================================================
//        AAD1CH1 Bits

extern __at(0x071F) __sfr AAD1CH1;

typedef struct
  {
  unsigned CH18                 : 1;
  unsigned CH19                 : 1;
  unsigned CH30                 : 1;
  unsigned CH31                 : 1;
  unsigned CH32                 : 1;
  unsigned CH33                 : 1;
  unsigned CH34                 : 1;
  unsigned CH35                 : 1;
  } __AAD1CH1bits_t;

extern __at(0x071F) volatile __AAD1CH1bits_t AAD1CH1bits;

#define _CH18                   0x01
#define _CH19                   0x02
#define _CH30                   0x04
#define _CH31                   0x08
#define _CH32                   0x10
#define _CH33                   0x20
#define _CH34                   0x40
#define _CH35                   0x80

//==============================================================================


//==============================================================================
//        AD1CH1 Bits

extern __at(0x071F) __sfr AD1CH1;

typedef struct
  {
  unsigned CH18                 : 1;
  unsigned CH19                 : 1;
  unsigned CH30                 : 1;
  unsigned CH31                 : 1;
  unsigned CH32                 : 1;
  unsigned CH33                 : 1;
  unsigned CH34                 : 1;
  unsigned CH35                 : 1;
  } __AD1CH1bits_t;

extern __at(0x071F) volatile __AD1CH1bits_t AD1CH1bits;

#define _AD1CH1_CH18            0x01
#define _AD1CH1_CH19            0x02
#define _AD1CH1_CH30            0x04
#define _AD1CH1_CH31            0x08
#define _AD1CH1_CH32            0x10
#define _AD1CH1_CH33            0x20
#define _AD1CH1_CH34            0x40
#define _AD1CH1_CH35            0x80

//==============================================================================


//==============================================================================
//        AAD2CON0 Bits

extern __at(0x0791) __sfr AAD2CON0;

typedef union
  {
  struct
    {
    unsigned ADON               : 1;
    unsigned GO                 : 1;
    unsigned CHS0               : 1;
    unsigned CHS1               : 1;
    unsigned CHS2               : 1;
    unsigned CHS3               : 1;
    unsigned CHS4               : 1;
    unsigned CHS5               : 1;
    };

  struct
    {
    unsigned AD2ON              : 1;
    unsigned GO_NOT_DONE        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned GO_NOT_DONE2       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CHS                : 6;
    };
  } __AAD2CON0bits_t;

