OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1567.h
extern __at(0x0791) volatile __AAD2CON0bits_t AAD2CON0bits;

#define _AAD2CON0_ADON          0x01
#define _AAD2CON0_AD2ON         0x01
#define _AAD2CON0_GO            0x02
#define _AAD2CON0_GO_NOT_DONE   0x02
#define _AAD2CON0_GO_NOT_DONE2  0x02
#define _AAD2CON0_CHS0          0x04
#define _AAD2CON0_CHS1          0x08
#define _AAD2CON0_CHS2          0x10
#define _AAD2CON0_CHS3          0x20
#define _AAD2CON0_CHS4          0x40
#define _AAD2CON0_CHS5          0x80

//==============================================================================


//==============================================================================
//        AD2CON0 Bits

extern __at(0x0791) __sfr AD2CON0;

typedef union
  {
  struct
    {
    unsigned ADON               : 1;
    unsigned GO                 : 1;
    unsigned CHS0               : 1;
    unsigned CHS1               : 1;
    unsigned CHS2               : 1;
    unsigned CHS3               : 1;
    unsigned CHS4               : 1;
    unsigned CHS5               : 1;
    };

  struct
    {
    unsigned AD2ON              : 1;
    unsigned GO_NOT_DONE        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned GO_NOT_DONE2       : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned CHS                : 6;
    };
  } __AD2CON0bits_t;

extern __at(0x0791) volatile __AD2CON0bits_t AD2CON0bits;

#define _AD2CON0_ADON           0x01
#define _AD2CON0_AD2ON          0x01
#define _AD2CON0_GO             0x02
#define _AD2CON0_GO_NOT_DONE    0x02
#define _AD2CON0_GO_NOT_DONE2   0x02
#define _AD2CON0_CHS0           0x04
#define _AD2CON0_CHS1           0x08
#define _AD2CON0_CHS2           0x10
#define _AD2CON0_CHS3           0x20
#define _AD2CON0_CHS4           0x40
#define _AD2CON0_CHS5           0x80

//==============================================================================


//==============================================================================
//        AAD2CON2 Bits

extern __at(0x0793) __sfr AAD2CON2;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TRIGSEL0           : 1;
    unsigned TRIGSEL1           : 1;
    unsigned TRIGSEL2           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned TRIGSEL            : 3;
    unsigned                    : 1;
    };
  } __AAD2CON2bits_t;

extern __at(0x0793) volatile __AAD2CON2bits_t AAD2CON2bits;

#define _AAD2CON2_TRIGSEL0      0x10
#define _AAD2CON2_TRIGSEL1      0x20
#define _AAD2CON2_TRIGSEL2      0x40

//==============================================================================


//==============================================================================
//        AD2CON2 Bits

extern __at(0x0793) __sfr AD2CON2;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned TRIGSEL0           : 1;
    unsigned TRIGSEL1           : 1;
    unsigned TRIGSEL2           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned TRIGSEL            : 3;
    unsigned                    : 1;
    };
  } __AD2CON2bits_t;

extern __at(0x0793) volatile __AD2CON2bits_t AD2CON2bits;

#define _AD2CON2_TRIGSEL0       0x10
#define _AD2CON2_TRIGSEL1       0x20
#define _AD2CON2_TRIGSEL2       0x40

//==============================================================================


//==============================================================================
//        AAD2CON3 Bits

extern __at(0x0794) __sfr AAD2CON3;

typedef union
  {
  struct
    {
    unsigned AD2DSEN            : 1;
    unsigned AD2IPEN            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AD2IPPOL           : 1;
    unsigned AD2EPPOL           : 1;
    };

  struct
    {
    unsigned ADDSEN             : 1;
    unsigned ADIPEN             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADIPPOL            : 1;
    unsigned ADEPPOL            : 1;
    };
  } __AAD2CON3bits_t;

extern __at(0x0794) volatile __AAD2CON3bits_t AAD2CON3bits;

#define _AAD2CON3_AD2DSEN       0x01
#define _AAD2CON3_ADDSEN        0x01
#define _AAD2CON3_AD2IPEN       0x02
#define _AAD2CON3_ADIPEN        0x02
#define _AAD2CON3_AD2IPPOL      0x40
#define _AAD2CON3_ADIPPOL       0x40
#define _AAD2CON3_AD2EPPOL      0x80
#define _AAD2CON3_ADEPPOL       0x80

//==============================================================================


//==============================================================================
//        AD2CON3 Bits

extern __at(0x0794) __sfr AD2CON3;

typedef union
  {
  struct
    {
    unsigned AD2DSEN            : 1;
    unsigned AD2IPEN            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned AD2IPPOL           : 1;
    unsigned AD2EPPOL           : 1;
    };

  struct
    {
    unsigned ADDSEN             : 1;
    unsigned ADIPEN             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADIPPOL            : 1;
    unsigned ADEPPOL            : 1;
    };
  } __AD2CON3bits_t;

extern __at(0x0794) volatile __AD2CON3bits_t AD2CON3bits;

